01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC 9(5) VALUE 10. 
01 WS-TEMP PIC 9(5).

PROCEDURE DIVISION.
    MOVE 'Hello, world!' TO WS-AREA-1
    ADD 1 TO WS-AREA-2
    MOVE WS-AREA-2 TO WS-TEMP
    DISPLAY WS-AREA-1
    DISPLAY WS-TEMP
    STOP RUN.